package org.example;

public class TASK_2 {
//    Подрабатывая в течение года, Вася собрал себе определенную сумму на поездку за границу,
//    а родители добавили ему от себя еще некоторую сумму.
//    Выведите в консоль сколько денег есть у Васи на отпуск (в евро) если:
//    Вася заработал 5000 грн,Родители добавили- 5000,
//    курс евро 1 евро = 28 грню

    public static void main(String[] args) {
        int a = 5000 + 5000;
        a /= 28;

        System.out.println(a);
    }
}
